{
  "name": "Cutscenes/Story Events/pumpkin_carving/pumpkin_carving",
  "lines": [
    {
      "speaker": "adeline",
      "text": "You're here! And you brought the pumpkins, wonderful. I knew I could rely on you, [Ari]. Hayden's crop came up a little short this year."
    },
    {
      "speaker": "adeline",
      "text": "Let me just take these and finish up the preparations. Can you go tell Aunt Elsie we're ready to start?"
    },
    {
      "speaker": "elsie",
      "text": "Good to see you, dear!",
      "choices": [
        {
          "text": "Hi. Adeline said we're ready to start... whatever this is.",
          "nextLine": 3
        },
        {
          "text": "What are we starting?",
          "nextLine": 4
        }
      ]
    },
    {
      "speaker": "elsie",
      "text": "Why do you look confused?"
    },
    {
      "speaker": "elsie",
      "text": "Oh, this is your first Halloween with us, isn't it? Well, you're in for a treat!"
    },
    {
      "speaker": "elsie",
      "text": "Attention, everyone! It's that time again - time for our annual Pumpkin Carving contest! We have some fabulous prizes on offer this year, so do your best!"
    },
    {
      "speaker": "elsie",
      "text": "First place wins this darling bespoke pumpkin beret, made by our very own Louis! Tres chic!"
    },
    {
      "speaker": "celine",
      "text": "Oooh, that's so cute! I wonder if my plants would grow better if they thought I was one of them?"
    },
    {
      "speaker": "holt",
      "text": "Ha! Bespook fashion!"
    },
    {
      "speaker": "elsie",
      "text": "..."
    },
    {
      "speaker": "elsie",
      "text": "Second place wins this batch of artisanal pumpkin spice wine!"
    },
    {
      "speaker": "holt",
      "text": "Hemlock's special recipe? Hoo boy! I drank so much of that good stuff last year, I felt gourd-awful the next morning!"
    },
    {
      "speaker": "juniper",
      "text": "Oh? How sneaky of you Hemlock, you told me you were all out."
    },
    {
      "speaker": "hemlock",
      "text": "That's the last batch, I swear! I'd already set it aside when you asked."
    },
    {
      "speaker": "juniper",
      "text": "Is that so? It looks like now I'll need to compete."
    },
    {
      "speaker": "holt",
      "text": "Gourd-awful, get it? Anyone?"
    },
    {
      "speaker": "elsie",
      "text": "...Moving on, third and last place wins one of Reina's delicious pumpkin pies!"
    },
    {
      "speaker": "march",
      "text": "These prizes are the same every year."
    },
    {
      "speaker": "olric",
      "text": "Yeah! Can't have too much of a good thing!"
    },
    {
      "speaker": "valen",
      "text": "Holt's cautionary tale seems to suggest otherwise. All things in moderation."
    },
    {
      "speaker": "adeline",
      "text": "Thanks for introducing the prizes, Elsie. Now that you know what you're competing for, let's start carving!"
    },
    {
      "speaker": "olric",
      "text": "Joining our team? Great to have you!"
    },
    {
      "speaker": "march",
      "text": "It's not a team contest. Only three of us will win."
    },
    {
      "speaker": "juniper",
      "text": "Well you certainly won't place, what is that even supposed to be?"
    },
    {
      "speaker": "valen",
      "text": "Whatever it is, it's better than your Dozy."
    },
    {
      "speaker": "juniper",
      "text": "Only because I'm using the same tools as everyone else in the spirit of fairness! I hope your surgical cuts are better than your pumpkin cuts!"
    },
    {
      "speaker": "valen",
      "text": "They're certainly sharper than your tongue, no matter how much wine whets it."
    },
    {
      "speaker": "march",
      "text": "Cut it out you two, you're supposed to be carving pumpkins, not each other."
    },
    {
      "speaker": "balor",
      "text": "What's yours supposed to be, Olric? You've barely made any cuts."
    },
    {
      "speaker": "olric",
      "text": "A rock!"
    },
    {
      "speaker": "march",
      "text": "A rock!? If you thought this was a team game then why aren't you trying harder?"
    },
    {
      "speaker": "olric",
      "text": "It's all about having fun, right Balor?"
    },
    {
      "speaker": "balor",
      "text": "And the prize."
    },
    {
      "speaker": "juniper",
      "text": "Yes, it's the prize."
    },
    {
      "speaker": "olric",
      "text": "But we already get a participation trophy?"
    },
    {
      "speaker": "valen",
      "text": "As if that would satisfy Juniper."
    },
    {
      "speaker": "juniper",
      "text": "As if you would know such a thing."
    },
    {
      "speaker": "balor",
      "text": "More wine would satisfy me, anyone want another?"
    },
    {
      "speaker": "juniper",
      "text": "Always!"
    },
    {
      "speaker": "valen",
      "text": "Sure."
    },
    {
      "speaker": "march",
      "text": "Beer, thanks."
    },
    {
      "speaker": "olric",
      "text": "Just a milk for me, please!"
    },
    {
      "speaker": "juniper",
      "text": "(Juniper appears to be chanting under her breath, and doesn't look away from the pumpkin in front of her.) Oh no..."
    },
    {
      "speaker": "juniper",
      "text": "That... wasn't supposed to happen."
    },
    {
      "speaker": "dell",
      "text": "My pumpkin is ruined!"
    },
    {
      "speaker": "valen",
      "text": "It seems several of the pumpkins are ruined."
    },
    {
      "speaker": "balor",
      "text": "Yours survived remarkably intact, though."
    },
    {
      "speaker": "valen",
      "text": "I have quick reflexes."
    },
    {
      "speaker": "dell",
      "text": "Well, mine didn't! How am I supposed to win now?!"
    },
    {
      "speaker": "eiland",
      "text": "It's alright, Dell, my pumpkin survived so you can enter it instead."
    },
    {
      "speaker": "dell",
      "text": "Really?! Thanks, Eiland!"
    },
    {
      "speaker": "adeline",
      "text": "Well, with that, uh, accident, I think it's time for the judging to begin!"
    },
    {
      "speaker": "dell",
      "text": "I'm gonna win that 2nd place prize, then give it to Juniper! She said she'll trade me for a potion to turn into a frog!"
    },
    {
      "speaker": "elsie",
      "text": "Due to the unfortunate incident that tragically cut our entries short, I'm afraid that everyone without a viable pumpkin will need to be disqualified."
    },
    {
      "speaker": "elsie",
      "text": "And Juniper? I'm sure you won't mind helping with the mess you made, hmm?"
    },
    {
      "speaker": "juniper",
      "text": "Yeah, yeah, I'll help out..."
    },
    {
      "speaker": "elsie",
      "text": "Wonderful! Now, let's make a start!"
    },
    {
      "speaker": "ryis",
      "text": "First up is Henrietta's entry..."
    },
    {
      "speaker": "ryis",
      "text": "Is that... an egg?"
    },
    {
      "speaker": "hayden",
      "text": "Of course it is! My girl is an artist!"
    },
    {
      "speaker": "ryis",
      "text": "Well it's certainly very... avant garde."
    },
    {
      "speaker": "march",
      "text": "I think she was just eating the pumpkin."
    },
    {
      "speaker": "josephine",
      "text": "Wow, there's certainly some... interesting pumpkins here."
    },
    {
      "speaker": "maple",
      "text": "I like Hayden's, it's so cute!"
    },
    {
      "speaker": "elsie",
      "text": "I've seen many carved pumpkins in my time but few compare to these ones."
    },
    {
      "speaker": "ryis",
      "text": "What's yours, [Ari]?",
      "choices": [
        {
          "text": "It's a dragon!",
          "nextLine": 66
        },
        {
          "text": "It's a jack-o-lantern!",
          "nextLine": 66
        },
        {
          "text": "It's free food.",
          "nextLine": 66
        }
      ]
    },
    {
      "speaker": "maple",
      "text": "I thought it was a cloud?"
    },
    {
      "speaker": "elsie",
      "text": "Now, now, enough of that! Please excuse us, we have much to discuss!"
    },
    {
      "speaker": "josephine",
      "text": "The winner for third place is... Eiland! Or, Dell, I suppose. Your prize is one of Reina's delicious pumpkin pies!"
    },
    {
      "speaker": "dell",
      "text": "Yes!!! Now I can be a frog!"
    },
    {
      "speaker": "juniper",
      "text": "Sorry, kiddo, but I wanted the wine, not the pie. I bet you're regretting giving her your pumpkin now, aren't you, Eiland?"
    },
    {
      "speaker": "eiland",
      "text": "A-Ah of course not... what kind of monster would regret giving up a delicious, limited edition Fall dessert to a child..."
    },
    {
      "speaker": "dell",
      "text": "It's okay, if Juniper won't trade me we can share the pie instead! Captain Dell always pays her crew well!"
    },
    {
      "speaker": "ryis",
      "text": "For second place, the much anticipated Pumpkin Spiced Wine goes to..."
    },
    {
      "speaker": "ryis",
      "text": "Valen!"
    },
    {
      "speaker": "valen",
      "text": "Naturally, of course, and no, Juniper, I will not be sharing. Unless you ask nicely."
    },
    {
      "speaker": "juniper",
      "text": "As if I could be tempted with such a superficial offering."
    },
    {
      "speaker": "valen",
      "text": "Is that why your hand is on the bottle?"
    },
    {
      "speaker": "elsie",
      "text": "Saving the best for last, time for the final prize - the coveted Pumpkin Beret! Drumroll please, first place goes to..."
    },
    {
      "speaker": "elsie",
      "text": "Hayden!"
    },
    {
      "speaker": "hayden",
      "text": "Oh! Thank you! Henrietta will be so happy!"
    },
    {
      "speaker": "josephine",
      "text": "Congratulations, Hayden!"
    },
    {
      "speaker": "elsie",
      "text": "Here is your prize, I'm sure Henrietta will be the height of fashion sporting such a beautiful beret! And that's a wrap folks! Let's hope there won't be too many accidents next year."
    },
    {
      "speaker": "adeline",
      "text": "Wait, [Ari]!, I- no, all of us wanted to thank you for all your hard work helping Mistria recover. I'm so glad you joined us."
    },
    {
      "speaker": "adeline",
      "text": "You've breathed new life into this village, and we couldn't have done all this without you. I made you a little treat as a thank you, I hope you like it"
    },
    {
      "speaker": "adeline",
      "text": "Happy Halloween, [Ari]. I’m excited for next year's contest already."
    }
  ]
}